run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/wycinekRury/bezQ/wycinekRuryBlockMeshBezQ_Pawel/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1e-10";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
14000
(
1.67506
1.67519
1.67531
1.67544
1.67556
1.67569
1.67581
1.67594
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 1.675;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY-SIDE-1
    {
        type            wedge;
    }
    SYMMETRY-SIDE-2
    {
        type            wedge;
    }
    WALL
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
