run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/wycinekRury/bezQ/wycinekRuryBlockMeshBezQ_Pawel/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.5074981803485489;

boundaryField
{
    WALL
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    INLET
    {
        type            fixedValue;
        value           nonuniform List<scalar>
		70
		(
			707.169136013
			177.152358234
			74.6863772928
			42.6474159485
			28.2523020654
			20.4458671972
			15.6909486397
			12.5558220721
...
			 );
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY-SIDE-1
    {
        type            wedge;
    }
    SYMMETRY-SIDE-2
    {
        type            wedge;
    }
}


// ************************************************************************* //
