run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/wycinekRury/bezQ/wycinekRuryBlockMeshBezQ_Pawel/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1450815;

boundaryField
{
    WALL
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    INLET
    {
        type            fixedValue;
        value           nonuniform List<scalar>
		70
		(
			0.649261188825
			0.33564598222
			0.222346725481
			0.170210620383
			0.139861958338
			0.119872150086
			0.105655728275
			0.0950001378292
...
			 );
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY-SIDE-1
    {
        type            wedge;
    }
    SYMMETRY-SIDE-2
    {
        type            wedge;
    }
}


// ************************************************************************* //
