run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/wycinekRury/bezQ/wycinekRuryBlockMeshBezQ_Pawel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)						//0
    (1.21 0 0)						//1
    (0 -0.00008115368993336833 0.00464929178247721926)		//2
    (1.21 -0.00008115368993336833 0.00464929178247721926)		//3
    (1.21 0.00008115368993336833 0.00464929178247721926)		//4
    (0 0.00008115368993336833 0.00464929178247721926)		//5
);

blocks          
(
    hex (0 1 1 0 2 3 4 5) (200 1 70) simpleGrading (1 1 0.1)

);

edges           
(
	arc 2 5 (0 0 0.00465)
	arc 3 4 (1.21 0 0.00465)
);

patches         
(
	patch
	INLET 
	(
		(0 2 5 0)
	)

	patch
	OUTLET
	(
		(1 3 4 1)
	)

	wedge
    SYMMETRY-SIDE-1
	(
		(0 1 3 2)
	)

	wedge
    SYMMETRY-SIDE-2
	(
		(0 1 4 5)
	)
		
	wall
	WALL
	(
		(2 3 4 5)
	)
);

mergePatchPairs
(
);

// ************************************************************************* //

